export const colorMapping: { [key: string]: string } = {
	N1: "rgba(0, 191, 255, 1)", // Blue
	N2: "rgba(147, 219, 112, 1)", // Green
	N3: "rgba(64, 224, 208, 1)", // Turquoise
	N4: "rgba(176, 226, 255, 1)", // Light Blue
	N5: "rgba(180, 255, 180, 1)", // Light Green
	N6: "rgba(135, 206, 235, 1)", // Sky Blue
	N7: "rgba(198, 226, 235, 1)", // Light Cyan
	N8: "rgba(111, 255, 195, 1)", // Light Green
	NA: "rgba(255, 153, 255, 1)", // Pink
	KP: "rgba(255, 25, 117, 1)", // Red
	CP: "rgba(255, 255, 0, 1)", // Yellow
};

export const validKaarakaSambandhaValues = [
    "नित्य_सम्बन्धः",
    "नित्य_सम्बन्धः1",
    "प्रतियोगी",
    "बहुव्रीहिः",
    "भावलक्षणसप्तमी_समानकालः",
    "भावलक्षणसप्तमी_पूर्वकालः",
    "भावलक्षणसप्तमी_अनन्तरकालः",
    "कर्ता_बे_वेर्ब्स्",
    "कर्मधारयः",
    "कर्ता",
    "कर्तृरहितकर्तृसमानाधिकरणम्",
    "विधेय_विशेषणम्",
    "मुख्यकर्म",
    "गौणकर्म",
    "वाक्यकर्म",
    "इतरेतर-द्वन्द्व",
    "षष्ठी-बहुव्रीहि",
    "बहुव्रीहि",
    "कर्मसमानाधिकरणम्",
    "कर्म",
];



// hide/show_columns 
// add_shloka 
// text_field 
// dictionary